results/run37_09.log
Sending build context to Docker daemon  50.09MB
Step 1/16 : FROM ubuntu:16.04
 ---> b9e15a5d1e1a
Step 2/16 : RUN apt-get update &&     apt-get upgrade -y &&     apt-get install -y 	git 	sqlite3 	curl 	make build-essential libssl-dev zlib1g-dev libbz2-dev     libreadline-dev libsqlite3-dev wget curl llvm libncurses5-dev libncursesw5-dev     xz-utils tk-dev libffi-dev liblzma-dev nginx
 ---> Using cache
 ---> 27fd36c0bbed
Step 3/16 : RUN curl -L https://github.com/pyenv/pyenv-installer/raw/master/bin/pyenv-installer | bash
 ---> Using cache
 ---> 8ac9eee594eb
Step 4/16 : ARG PY_VERSION
 ---> Using cache
 ---> d6d9f140a355
Step 5/16 : RUN /root/.pyenv/bin/pyenv install $PY_VERSION
 ---> Using cache
 ---> 2feaf9f2f241
Step 6/16 : RUN rm -rf /var/lib/apt/lists/*
 ---> Using cache
 ---> 2a3647cd9a00
Step 7/16 : ENV PATH "/root/.pyenv/versions/$PY_VERSION/bin/:${PATH}"
 ---> Using cache
 ---> 771d8afe5d3e
Step 8/16 : RUN git clone --depth 1 -b 4.1.0 https://github.com/wg/wrk.git /home/wrk &&     make -C /home/wrk > /dev/null
 ---> Using cache
 ---> ef4f36b4234c
Step 9/16 : ARG REQUIREMENTS
 ---> Using cache
 ---> 0995f8894bd4
Step 10/16 : COPY $REQUIREMENTS /home/src/requirements.txt
 ---> Using cache
 ---> ea59eac2561b
Step 11/16 : RUN pip install -r /home/src/requirements.txt
 ---> Using cache
 ---> 148b46d3f247
Step 12/16 : ARG SRC_DIR
 ---> Using cache
 ---> 44c225682725
Step 13/16 : COPY $SRC_DIR /home/src/
 ---> 320e08985bb8
Step 14/16 : RUN mv /home/src/db.sqlite3 /home
 ---> Running in d7d1d6a9e5ad
Removing intermediate container d7d1d6a9e5ad
 ---> b38818633cf0
Step 15/16 : WORKDIR /home/src/
 ---> Running in fd8dabd1eb5c
Removing intermediate container fd8dabd1eb5c
 ---> cb626109e706
Step 16/16 : ENTRYPOINT /home/src/run.sh
 ---> Running in 4612e0665304
Removing intermediate container 4612e0665304
 ---> 0c8ef1106da1
Successfully built 0c8ef1106da1
Successfully tagged py37:latest
start

Check API...
Hello{"summary":"postponed evaluation of type annotations","description":"In addition, Django applies the following rule: if you set editable=False on the model field, any form created from the model via ModelForm will not include that field.","project":"treehook","region":"europe","total_budget":650012.5,"info":"To avoid this failure, you must instantiate your","purpose":"Overriding the default fields","department":"Salary","business":"TYYJJB","is_budget":1,"customer":"jtmoore","owner":"hqsalmon","approved_by":"tewagner","created_at":"2018-09-09 11:46:52.352830","updated_at":"2018-09-09 11:46:52.352839","expires_at":null,"closed":0}  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100     9  100     9    0     0   1723      0 --:--:-- --:--:-- --:--:--  1800
sanic_app
APP sanic_app is ok

Run wrk...

WRK PING BENCH:
==========================================
Running 1m test @ http://localhost:80
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    94.56us   55.00us   4.45ms   96.37%
    Req/Sec    10.73k     1.55k   12.20k    81.86%
  Latency Distribution
     50%   85.00us
     75%   91.00us
     90%  119.00us
     99%  198.00us
  641436 requests in 1.00m, 75.24MB read
Requests/sec:  10672.92
Transfer/sec:      1.25MB

WRK GET BENCH:
==========================================
Running 1m test @ http://localhost:80
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.75ms  364.01us  11.90ms   80.30%
    Req/Sec   148.10      5.08   161.00     69.00%
  Latency Distribution
     50%    6.84ms
     75%    6.98ms
     90%    7.10ms
     99%    7.31ms
  8862 requests in 1.00m, 6.31MB read
Requests/sec:    147.55
Transfer/sec:    107.64KB

WRK PING BENCH:
==========================================
Running 1m test @ http://localhost:80
  4 threads and 60 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.22ms  763.25us  15.85ms   75.03%
    Req/Sec    12.79k     3.62k   30.53k    70.39%
  Latency Distribution
     50%    1.21ms
     75%    1.51ms
     90%    1.91ms
     99%    4.05ms
  3056291 requests in 1.00m, 358.51MB read
Requests/sec:  50853.67
Transfer/sec:      5.97MB

WRK GET BENCH:
==========================================
Running 1m test @ http://localhost:80
  4 threads and 60 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.20ms    4.80ms  52.01ms   66.82%
    Req/Sec   827.30    109.43     1.10k    63.28%
  Latency Distribution
     50%   18.41ms
     75%   21.39ms
     90%   24.19ms
     99%   29.49ms
  197765 requests in 1.00m, 140.89MB read
Requests/sec:   3292.02
Transfer/sec:      2.35MB
stop